wt10661.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-15 Wed 16:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>给WiredTiger(MongoDB)提了个build bugfix</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="latexcss/latexcss.css" />
<link rel="stylesheet" type="text/css" href="../latexcss/latexcss.css" />
<link rel="alternate stylesheet" type="https://orgmode.org/resources/style/org-demo.min.css" />
<link rel="alternate stylesheet" type="../latexcss/latexcss.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">给WiredTiger(MongoDB)提了个build bugfix</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc320a67">1. 起因</a></li>
<li><a href="#orgbefbaca">2. 关于Windows上的DLL</a></li>
<li><a href="#orgf1f1579">3. WiredTiger的三方库</a></li>
<li><a href="#org007ee1a">4. 其它修改</a>
<ul>
<li><a href="#orgbab0451">4.1. detect zlib on windows</a></li>
<li><a href="#orgaccfbf0">4.2. link debug CRT</a></li>
</ul>
</li>
<li><a href="#org1de3476">5. 在Windows上编译安装WiredTiger</a></li>
</ul>
</div>
</div>
<p>
<a href="./index.html">Back to index</a>
</p>

<div id="outline-container-orgc320a67" class="outline-2">
<h2 id="orgc320a67"><span class="section-number-2">1.</span> 起因</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在Windows上测试RocksDB和WiredTiger的基准性能，build过程比较曲折，先是写了个wiredtiger-11.1.0的vcpkg的port(<a href="https://github.com/kabu1204/wiredtiger-vcpkg">kabu1204/wiredtiger-vcpkg</a>)，然后给YCSB-cpp加了<a href="https://github.com/ls4154/YCSB-cpp/pull/9">win64和wiredtiger支持</a>。
做这些的目的是想着组里以后做相关实验时，环境配置更方便一些，因此我在每个commit、每个PR上都附上了详细的说明。本来做完这些已经足够了，至少过去很久我也可以照着当初写的README可以很快地装好所有环境，对每处改动只要看commit message就能完全理解意图。
本着开源精神，还是先试探性地给MongoDB Jira提了个issue（<a href="https://jira.mongodb.org/browse/WT-10661">[WT-10661] builtin compressors on windows</a>），并附上了我的建议修改。没想到社区的人回复很快，并且assignee在简单测试后鼓励我提PR。之后在正规测试和code review后，很快便合并了。尽管只是个小的build bug，他们的态度让我对mongodb这个社区好感度++。现在只是个还在学习的菜鸟，期待以后有机会更多地参与其中，我很乐意为这样的社区贡献精力。
</p>
</div>
</div>

<div id="outline-container-orgbefbaca" class="outline-2">
<h2 id="orgbefbaca"><span class="section-number-2">2.</span> 关于Windows上的DLL</h2>
<div class="outline-text-2" id="text-2">
<p>
Windows和POSIX的dynamic library有一定区别。
POSIX的.so&lt;.x.y.z&gt;是共享库，可以动态链接。有两种方式，一是编译时指定链接库（包含库的头文件并且 <code>-L &lt;path&gt; -l&lt;libxxx.so&gt;</code> ）；二是使用dl库，在运行时加载库函数，无需编译时指定链接库位置，也不用包含库头文件，但开发者自己需要知道函数原型。
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #b35caf;">#include</span> <span style="color: #8b008b;">"dlfcn.h"</span>
<span style="color: #0000cd;">typedef</span> <span style="color: #228b22;">int</span> (*<span style="color: #228b22;">add_fn_t</span>)(<span style="color: #228b22;">int</span>, <span style="color: #228b22;">int</span>);
<span style="color: #228b22;">void</span> <span style="color: #ff0000;">main</span>(){
    <span style="color: #228b22;">void</span> *<span style="color: #a0522d;">libadd</span> = dlopen(<span style="color: #8b008b;">"./libadd.so"</span>,RTLD_LAZY);
    <span style="color: #228b22;">add_fn_t</span> <span style="color: #a0522d;">add</span> = (<span style="color: #228b22;">add_fn_t</span>)dlsym(libadd, <span style="color: #8b008b;">"add"</span>);
    add(1, 2);
}
</pre>
</div>

<p>
Windows的静态库只有一个.lib文件，包含位置信息和函数实现。
</p>

<p>
Windows的动态库由两部分组成，.lib和.dll文件：
</p>
<ul class="org-ul">
<li>.lib文件描述了函数在.dll中的位置信息，本身不包含实现。</li>
<li>.dll文件包含了函数实现。</li>
</ul>

<p>
如果我们想编译时指定动态链接库，则需要告知编译器.lib文件的位置。在函数运行时会去加载对应的.dll文件中的符号实现。
</p>

<p>
也可以用LoadLibrary在windows上运行时再加载动态库，和POSIX的dlopen类似。这时只需要.dll文件。
</p>
</div>
</div>

<div id="outline-container-orgf1f1579" class="outline-2">
<h2 id="orgf1f1579"><span class="section-number-2">3.</span> WiredTiger的三方库</h2>
<div class="outline-text-2" id="text-3">
<p>
WiredTiger是MongoDB的底层存储引擎，它有一些cmake选项，可以链接第三方库（如一些压缩算法库lz4,snappy,zstd,zlib等）。
</p>

<p>
这些三方库在 <code>cmake/configs/auto.cmake</code> 中通过cmake的find_library函数引入。而后在 <code>cmake/third_party/&lt;name&gt;.cmake</code> 中IMPORT为 <code>wt::&lt;name&gt;</code> ：
</p>
<div class="org-src-container">
<pre class="src src-cmake">add_library(wt::lz4 SHARED IMPORTED GLOBAL)
set_target_properties(wt::lz4 PROPERTIES
    IMPORTED_LOCATION ${HAVE_LIBLZ4}
)
</pre>
</div>

<p>
其中 <code>${HAVE_LIBLZ4}</code> 就是find_library(lz4)找到的lz4动态库的.lib文件的位置。
而对于一个 <code>IMPORTED SHARED</code> 库，在POSIX上，我们需要指定 <code>IMPORTED_LOCATION</code> 为.so文件的位置。在Windows上，我们需要指定 <code>IMPORTED_IMPLIB</code> 为.lib文件的位置：
</p>
<blockquote>
<p>
For a SHARED library on Windows, the IMPORTED_IMPLIB target property (or its per-configuration variant IMPORTED_IMPLIB_&lt;CONFIG&gt;) specifies the location of the DLL import library file (.lib or .dll.a) on disk, and the IMPORTED_LOCATION is the location of the .dll runtime library (and is optional, but needed by the TARGET_RUNTIME_DLLS generator expression).
</p>
</blockquote>

<p>
因此这两个属性不会同时被使用到（起码在wiredtiger中，TARGET_RUNTIME_DLLS没有用到），因此我们将他们都设为 <code>${HAVE_LIBLZ4}</code> 就可以了。
</p>

<p>
所以这就是本次bugfix的内容：<a href="https://github.com/wiredtiger/wiredtiger/pull/8873">https://github.com/wiredtiger/wiredtiger/pull/8873</a>
</p>
</div>
</div>

<div id="outline-container-org007ee1a" class="outline-2">
<h2 id="org007ee1a"><span class="section-number-2">4.</span> 其它修改</h2>
<div class="outline-text-2" id="text-4">
<p>
这两处额外的修改主要是为了正确通过vcpkg构建wiredtiger。其实算不上bug，因此也没有提issue。
</p>
</div>
<div id="outline-container-orgbab0451" class="outline-3">
<h3 id="orgbab0451"><span class="section-number-3">4.1.</span> detect zlib on windows</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>cmake/configs/auto.cmake</code> 查找zlib时使用的名字是z，在POSIX上会去搜索libz.*，在Windows上会搜索z.lib，然而zlib在Windows上的库文件一般叫zlib.lib：
</p>
<div class="org-src-container">
<pre class="src src-patch">diff --git a/cmake/configs/auto.cmake b/cmake/configs/auto.cmake
index ac8776989..98c4a014e 100644
--- a/cmake/configs/auto.cmake
+++ b/cmake/configs/auto.cmake
@@ -256,12 +256,21 @@ config_lib(
     HEADER "snappy.h"
 )

-config_lib(
-    HAVE_LIBZ
-    "zlib library exists."
-    LIB "z"
-    HEADER "zlib.h"
-)
+if(MSVC AND "${WT_OS}" STREQUAL "windows")
+    config_lib(
+        HAVE_LIBZ
+        "zlib library exists."
+        LIB "zlib"
+        HEADER "zlib.h"
+    )
+else()
+    config_lib(
+        HAVE_LIBZ
+        "zlib library exists."
+        LIB "z"
+        HEADER "zlib.h"
+    )
+endif()
</pre>
</div>

<p>
其实可以通过在环境变量里指定Z_DIR来解决，所以算不上bug。为了方便vcpkg构建，我还是加了这个patch。
</p>
</div>
</div>

<div id="outline-container-orgaccfbf0" class="outline-3">
<h3 id="orgaccfbf0"><span class="section-number-3">4.2.</span> link debug CRT</h3>
<div class="outline-text-3" id="text-4-2">
<p>
CRT是Windows提供的C运行时函数库（包括malloc,printf等）。
通过/MD可以链接msvcrt.lib，是crt的动态链接库版本。
通过/MT可以连接libcmt.lib，是crt的静态库版本。
通过/MDd可以连接msvcrtd.lib，是crt的动态链接库版本，但带有debug info。
同理/MTd。
</p>

<p>
但是wiredtiger的 <code>cmake/configs/base.cmake</code> 指定在任何模式下都链接release版本。这样做没问题，一般也没人去debug标准库。但是坑爹的是vcpkg在构建完一个包后会检查你的CRT是否正确连接了Release/Debug版本，所以还是加了这个patch。
</p>

<div class="org-src-container">
<pre class="src src-patch">diff --git a/cmake/configs/base.cmake b/cmake/configs/base.cmake
index a8ca7681f..ef876b7ab 100644
--- a/cmake/configs/base.cmake
+++ b/cmake/configs/base.cmake
@@ -362,9 +362,17 @@ if(WT_WIN)
     # Check if we a using the dynamic or static run-time library.
     if(DYNAMIC_CRT)
	 # Use the multithread-specific and DLL-specific version of the run-time library (MSVCRT.lib).
-        add_compile_options(/MD)
+        if("${CMAKE_BUILD_TYPE}" STREQUAL "Debug")
+            add_compile_options(/MDd)
+        else()
+            add_compile_options(/MD)
+        endif()
     else()
	 # Use the multithread, static version of the run-time library.
-        add_compile_options(/MT)
+        if("${CMAKE_BUILD_TYPE}" STREQUAL "Debug")
+            add_compile_options(/MTd)
+        else()
+            add_compile_options(/MT)
+        endif()
     endif()
 endif()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1de3476" class="outline-2">
<h2 id="org1de3476"><span class="section-number-2">5.</span> 在Windows上编译安装WiredTiger</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://github.com/kabu1204/wiredtiger-vcpkg">https://github.com/kabu1204/wiredtiger-vcpkg</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2023-03-15 Wed 16:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
